import { DiaryType, MyExerciseType } from "types/myRecord.type";

export const myDiaries: DiaryType[] = [
  {
    id: "d0",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d1",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d2",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d3",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d4",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d5",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d6",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d7",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d8",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d9",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d10",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: "d11",
    date: "2022-05-21T23:25:00.000Z",
    content:
      "私の日記の記録が一部表示されます。\nテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
];

export const myBodyRecord = {
  date: "2022-05-21T00:00:00.000Z",
  line1: [100, 90, 60, 70, 70, 65, 80, 75, 70, 62, 60, 70],
  line2: [100, 95, 90, 80, 75, 60, 55, 50, 40, 35, 30, 20],
  labels: [
    "6月",
    "7月",
    "8月",
    "9月",
    "10月",
    "11月",
    "12月",
    "1月",
    "2月",
    "3月",
    "4月",
    "5月",
  ],
};

export const myExercises: MyExerciseType = {
  date: "2022-05-21T00:00:00.000Z",
  exercises: [
    {
      id: "e0",
      name: "家事全般",
      memo: "立位・軽い",
      caloriesLost: 26000,
      duration: 600,
    },
    {
      id: "e1",
      name: "家事全般",
      memo: "立位・軽い",
      caloriesLost: 21000,
      duration: 300,
    },
    {
      id: "e2",
      name: "家事全般",
      memo: "立位・軽い",
      caloriesLost: 25000,
      duration: 600,
    },
    {
      id: "e3",
      name: "家事全般",
      memo: "立位・軽い",
      caloriesLost: 26000,
      duration: 600,
    },
    {
      id: "e4",
      name: "家事全般",
      memo: "立位・軽い",
      caloriesLost: 26000,
      duration: 600,
    },
    {
      id: "e5",
      name: "家事全般",
      memo: "立位・軽い",
      caloriesLost: 26000,
      duration: 600,
    },
    {
      id: "e6",
      name: "家事全般",
      memo: "立位・軽い",
      caloriesLost: 23000,
      duration: 700,
    },
    {
      id: "e7",
      name: "家事全般",
      memo: "立位・軽い",
      caloriesLost: 26000,
      duration: 800,
    },
  ],
};
